{
  "backend/main.mo": "Motoko actor implementing a fitness tracking backend with CRUD operations for exercises (with equipment/muscle validation), workouts, and weight entries stored in Maps with auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report documenting two completed features for updating the dark mode color palette to black and red in both index.css and tailwind.config.js.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a black and red themed fitness tracking app with exercise library, workout management, weight logging, and progress tracking pages.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color variables for light and dark modes with grayscale values (0 chroma) for backgrounds/foregrounds and colorful chart variables for data visualization.",
  "frontend/index.html": "Minimal HTML entry point for the FitTrack Pro app with a root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for exercises, workouts, weight logging, and progress pages, wrapped in a dark-mode-only ThemeProvider with shared Navigation layout.",
  "frontend/src/components/ExerciseCard.tsx": "Reusable card component displaying exercise name with color-coded badges for equipment type and muscle group using predefined chart color mappings.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation bar with FitTrack Pro branding and active-state-aware links to Exercises, Workouts, Log, and Progress pages.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the backend actor instance with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating workout data including exercises, workouts, and weight entries, with filtering by equipment and muscle group.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, design tokens (radius, borders, charts), and Google Fonts imports for Inter and Rajdhani.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Displays a filterable exercise library with equipment and muscle group filters, includes seed functionality for populating initial exercises, and renders exercise cards.",
  "frontend/src/pages/LogWeight.tsx": "Form page for logging weight training entries with exercise selection, weight/reps/sets inputs, and success feedback after submission.",
  "frontend/src/pages/WeightProgress.tsx": "Displays historical weight progress for a selected exercise with trend indicators (up/down/same) comparing consecutive entries and formatted dates.",
  "frontend/src/pages/WorkoutDetail.tsx": "Displays details of a single workout including its name and number of exercises, with loading states and navigation back to the workouts list.",
  "frontend/src/pages/WorkoutForm.tsx": "Form component for creating or editing workouts with name input, exercise search/selection, and save functionality that handles both create and update operations.",
  "frontend/src/pages/WorkoutsList.tsx": "Lists all workouts with a button to create new workouts, currently showing an empty state placeholder when no workouts exist.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme including OKLCH color system, Inter/Rajdhani fonts, custom animations, and plugins for typography and container queries.",
  "project_state.json": "Project state tracking document listing implemented features including dark mode UI, exercise library with filtering, workout creation, weight logging, and CRUD operations for exercises."
}