{
  "backend/main.mo": "Main actor defining Exercise, Workout, and WeightEntry types with CRUD operations, validation for equipment types and muscle groups, and in-memory storage using Maps with auto-incrementing ID counters.",
  "backend/migration.mo": "Migration module that pre-populates 30 exercises covering various equipment types and muscle groups into the exercises map during actor initialization.",
  "feature_evidence.json": "Feature evidence report documenting that the ExerciseLibrary page seed functionality can populate 30 exercises, with high confidence and linked to test REQ-2.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files noting that the seed button was removed from ExerciseLibrary.tsx since 30 exercises are now automatically populated via backend migration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system for dark mode, custom CSS variables for theming, and fitness-focused red primary color palette.",
  "frontend/index.html": "HTML entry point for the FitTrack Pro application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Home, Exercises, Workouts, Log, and Progress pages, wrapped in dark theme provider with navigation layout and toast notifications.",
  "frontend/src/components/ExerciseCard.tsx": "Exercise card component with edit/delete dialogs, color-coded badges for equipment and muscle groups, and mutation hooks for update/delete operations with toast feedback.",
  "frontend/src/components/Navigation.tsx": "Main navigation header component with sticky positioning, displaying the FitTrack Pro logo and navigation links (Home, Exercises, Workouts, Log, Progress) with active state highlighting using TanStack Router.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on exercises, workouts, and weight entries, wrapping backend actor calls with proper caching, invalidation, and error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, design tokens (radius, borders, etc.), and Google Fonts imports for Inter and Rajdhani font families.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Exercise library page component with filtering by equipment type and muscle group, displaying exercise cards in a grid, and a dialog for creating new exercises with validation and toast notifications.",
  "frontend/src/pages/Home.tsx": "Landing page component displaying hero section with app branding and a grid of four feature cards (Exercise Library, Workouts, Log Weight, Progress) with navigation links and call-to-action buttons.",
  "frontend/src/pages/LogWeight.tsx": "Form page for logging workout weight entries with exercise selection dropdown, weight/reps/sets inputs, and success feedback using React Query mutations and toast notifications.",
  "frontend/src/pages/WeightProgress.tsx": "Progress tracking page displaying historical weight entries for a selected exercise with trend indicators (up/down/same) comparing consecutive entries.",
  "frontend/src/pages/WorkoutDetail.tsx": "Detail view page for a single workout showing its name and exercise count with back navigation to workouts list.",
  "frontend/src/pages/WorkoutForm.tsx": "Create/edit workout form with name input and searchable exercise selection list, supporting both new workout creation and existing workout updates via React Query mutations.",
  "frontend/src/pages/WorkoutsList.tsx": "Workouts list page with empty state placeholder and button to navigate to workout creation form.",
  "frontend/src/utils/formatting.ts": "Utility function to capitalize the first letter of each word in a string, used for formatting muscle group names.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), fonts (Inter and Rajdhani), animations, and including typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for a fitness/workout tracking app that needs to pre-populate an exercise library with 30 exercises categorized by machine type (Free Weight, Machine, Dumbbell, Cable) and muscle group (lower body, chest, back, shoulders, biceps, triceps, core). Contains two pending feature requests (AR-1 and AR-2) for adding the pre-defined exercises to the backend and ensuring seed functionality works."
}