{
  "backend/main.mo": "Motoko actor implementing a fitness tracking backend with CRUD operations for exercises, workouts, and weight entries, including validation for equipment types and muscle groups.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: scrollable dropdown menus in exercise selection forms and fixes to workout page functionality.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and utilities for the fitness tracking application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining dark mode theme variables and global styles for the fitness app.",
  "frontend/index.html": "HTML entry point for the FitTrack Pro application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for home, exercises, workouts, logging, and progress pages, wrapped in dark theme provider.",
  "frontend/src/components/ExerciseCard.tsx": "Exercise card component with edit/delete dialogs, color-coded badges for equipment and muscle groups, and mutation hooks for CRUD operations.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation bar with app branding and links to all main pages, highlighting the active route.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the Internet Computer actor instance with authentication support and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on exercises, workouts, and weight entries, integrating with the backend actor and managing query cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, design tokens (radius, borders, charts), and Google Fonts imports for Inter and Rajdhani.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Exercise library page with filtering by equipment and muscle group, displaying exercise cards in a grid, and a dialog for creating new exercises with validation.",
  "frontend/src/pages/Home.tsx": "Landing page displaying hero section with app branding and a feature grid linking to main sections (Exercise Library, Workouts, Log Weight, Progress).",
  "frontend/src/pages/LogWeight.tsx": "Form page for logging weight entries with exercise selection dropdown, input fields for weight/reps/sets, and success feedback after submission.",
  "frontend/src/pages/WeightProgress.tsx": "Displays weight progress tracking for selected exercises with trend indicators (up/down/same) and formatted date display. Uses Select component for exercise selection and Card components to show historical weight entries.",
  "frontend/src/pages/WorkoutDetail.tsx": "Shows detailed view of a single workout with edit and delete functionality. Displays workout name, exercise count, and includes AlertDialog for delete confirmation.",
  "frontend/src/pages/WorkoutForm.tsx": "Form component for creating and editing workouts with name input and exercise selection. Includes search functionality to filter exercises and manages selected exercises state.",
  "frontend/src/pages/WorkoutsList.tsx": "Lists all user workouts in a card grid layout with creation dates and exercise counts. Shows empty state with call-to-action when no workouts exist.",
  "frontend/src/utils/formatting.ts": "Utility function that capitalizes the first letter of each word in a string, used for consistent muscle group name display.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), fonts (Inter and Rajdhani), animations, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata tracking fitness app state with 28 exercises, known issues about non-scrollable dropdowns and workout page problems, and two pending feature requests to fix these issues."
}