{
  "backend/main.mo": "Motoko actor implementing a fitness tracking backend with CRUD operations for exercises, workouts, and weight entries, including validation for equipment types and muscle groups.",
  "feature_evidence.json": "Feature evidence report documenting implementation of home page navigation, exercise library CRUD operations (create, edit, delete) with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose, from styling and routing to individual page components and hooks.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a fitness app with custom design tokens.",
  "frontend/index.html": "HTML entry point for the FitTrack Pro application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for home, exercises, workouts, logging, and progress pages, wrapped in dark theme provider.",
  "frontend/src/components/ExerciseCard.tsx": "Exercise card component with inline edit and delete dialogs, color-coded badges for equipment and muscle groups, and mutation hooks for updates.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation bar with app branding and links to all main sections (Home, Exercises, Workouts, Log, Progress) with active state highlighting.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the backend actor instance with Internet Identity authentication, automatically invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on exercises, workouts, and weight entries, including filtering by equipment/muscle group and invalidating caches on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, design tokens (radius, borders, charts), and Google Fonts imports for Inter and Rajdhani.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Exercise library page with filtering by equipment/muscle group, seeding functionality, and a dialog for creating new exercises with validation and toast notifications.",
  "frontend/src/pages/Home.tsx": "Landing page displaying hero section and feature cards linking to Exercise Library, Workouts, Log Weight, and Progress sections with call-to-action buttons.",
  "frontend/src/pages/LogWeight.tsx": "Form page for logging weight entries with exercise selection dropdown and inputs for weight, reps, and sets, showing success feedback after submission.",
  "frontend/src/pages/WeightProgress.tsx": "Displays weight progress tracking for selected exercises with trend indicators (up/down/same) and formatted date entries. Uses Select component for exercise selection and Card components to display historical weight entries with visual trend badges.",
  "frontend/src/pages/WorkoutDetail.tsx": "Shows details of a single workout including its name and number of exercises. Includes navigation back to workouts list and handles loading/not-found states.",
  "frontend/src/pages/WorkoutForm.tsx": "Form component for creating and editing workouts with name input and exercise selection via searchable list. Handles both create and update modes based on route parameters and validates required fields before submission.",
  "frontend/src/pages/WorkoutsList.tsx": "Lists all workouts with a button to create new ones. Currently shows empty state with prompt to create first workout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter, Rajdhani), chart colors, and animation keyframes for accordion components.",
  "project_state.json": "Project state tracking file documenting a fitness exercise library application with existing CRUD features for exercises and pending feature requests to add muscle groups and equipment types."
}